Repository: berecont/contao-contentslider-extended-bundle
Catalog: contao/languages/*/*_content.xlf
Languages: de

# tl_content.sliderStopAutoplay.0
source: Pause autoplay on hover
de: Autoplay bei Hover pausieren

# tl_content.sliderStopAutoplay.1
source: If autoplay is active, pause when the mouse hovers the slider.
de: Ist Autoplay aktiv, pausiert der Slider bei Mouse-Over.

# tl_content.sliderInitClass.0
source: Additional Swiper class
de: Zusätzliche Swiper-Klasse

# tl_content.sliderInitClass.1
source: For targeting a single slider instance (e.g., "mySwiperA").
de: Zur gezielten Initialisierung/Styling einzelner Slider-Instanzen (z. B. „mySwiperA“).

# tl_content.sliderHideNavigation.0
source: Hide navigation
de: Navigation ausblenden

# tl_content.sliderHideNavigation.1
source: Do not render prev/next buttons.
de: Prev-/Next-Buttons nicht ausgeben.

# tl_content.sliderHidePagination.0
source: Hide pagination
de: Pagination ausblenden

# tl_content.sliderHidePagination.1
source: Do not render pagination bullets.
de: Paginierungspunkte nicht ausgeben.

# tl_content.sliderBreakpoints.1
source: Plain JSON object for Swiper breakpoints. Example: { "480": { "slidesPerView": 1, "spaceBetween": 8 }, "768": { "slidesPerView": 2, "spaceBetween": 16 }, "1024": { "slidesPerView": 3, "spaceBetween": 24 } }
de: Reines JSON-Objekt für Swiper-Breakpoints. Beispiel: { "480": { "slidesPerView": 1, "spaceBetween": 8 }, "768": { "slidesPerView": 2, "spaceBetween": 16 }, "1024": { "slidesPerView": 3, "spaceBetween": 24 } }

# tl_content.sliderCustomOptions.0
source: Additional parameters (JS fragment)
de: Zusätzliche Parameter (JS-Fragment)

# tl_content.sliderCustomOptions.1
source: Any Swiper options as a JS fragment or JSON – merged into initialization. Example: spaceBetween: 24, effect: 'fade', fadeEffect: { crossFade: true }
de: Beliebige Swiper-Optionen als JS-Fragment oder JSON – werden in die Initialisierung gemerged. Beispiel: spaceBetween: 24, effect: 'fade', fadeEffect: { crossFade: true }
